app/Controllers/Market.php

SELECT *
FROM `market`
SELECT *
FROM `mahasiswa`
---
    public function index()
    {

        $data = [
            'title' => 'Market',
            'market' => $this->MarketModel->getMarket(),
            'items' => $this->MarketModel->findAll(),
            'mahasiswa' => $this->MahasiswaModel->findAll(),