app/Models/BadgesModel.php

SELECT *
FROM `badges`
---
    public function getBadges()
    {
        return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `badges`
---
    public function totalBadges()
    {
        return $this->countAll();