app/Models/DataTransaksiModel.php

    public function getDataTransaksi()
    {
        return $this->findAll();
---
SELECT *
FROM `data_transaksi`

    public function getDataTransaksiUser($npm)
    {
        // Adjust your query to filter transactions based on the npm parameter
        return $this->where('npm', $npm)->get()->getResultArray();
---
SELECT *
FROM `data_transaksi`
WHERE `npm` = '1184097'

    public function getNpmList()
    {
        $npmList = $this->distinct()->select('npm')->findAll();
---
SELECT DISTINCT `npm`
FROM `data_transaksi`

    public function totalReward()
    {
        return $this->where('jenis_transaksi', 101)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 101

    public function totalPembelian()
    {
        return $this->where('jenis_transaksi', 102)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 102

    public function totalPunishment()
    {
        return $this->where('jenis_transaksi', 103)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 103

    public function totalMisi()
    {
        return $this->where('jenis_transaksi', 105)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 105

    public function Reward($npm)
    {
        return $this->where('jenis_transaksi', 101)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 101
AND `npm` = '1184097'

    public function Pembelian($npm)
    {
        return $this->where('jenis_transaksi', 102)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 102
AND `npm` = '1184097'

    public function Punishment($npm)
    {
        return $this->where('jenis_transaksi', 103)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 103
AND `npm` = '1184097'

    public function Misi($npm)
    {
        return $this->where('jenis_transaksi', 105)->where('npm', $npm)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data_transaksi`
WHERE `jenis_transaksi` = 105
AND `npm` = '1184097'

    public function getJenis($jenis = false)
    {
        return $this->where(['jenis_transaksi' => $jenis])->find();
---
SELECT *
FROM `data_transaksi`
WHERE `jenis_transaksi` = ('105')