app/Models/GayaBelajarModel.php

    public function getGaya()
    {
        return $this->findAll();
---
SELECT *
FROM `jenis_gaya_belajar`