app/Models/JenisTransaksiModel.php

    public function getJenis()
    {
        return $this->findAll();
---
SELECT *
FROM `jenis_transaksi`