app/Models/KendaraanModel.php

SELECT *
FROM `data_kendaraan`
WHERE `jenis` = ('Roda 2')
---
    public function getRoda($jenis = false)
    {
        return $this->where(['jenis' => $jenis])->find();