app/Models/MahasiswaModel.php

SELECT COUNT(*) AS `numrows` FROM `mahasiswa`
---
    public function total()
    {
        return $this->countAll();

SELECT *
FROM `mahasiswa`
---
    public function getMhs()
    {
        return $this->findAll();