app/Models/MarketModel.php

    public function getMarket()
    {
        return $this->findAll();
---
SELECT *
FROM `market`