app/Models/TransaksiModel.php

    public function getTransaksi()
    {
        return $this->findAll();
---
SELECT *
FROM `transaksi`

    public function getJenis($jenis = false)
    {
        return $this->where(['kode_jenis' => $jenis])->find();
---
SELECT *
FROM `transaksi`
WHERE `kode_jenis` = ('103')